//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "用户名或密码错误";
"_cancelled_by_user"                    = "传输被取消";
"_error_folder_destiny_is_the_same_"    = "不能移动文件夹到它本身";
"_error_not_permission_"                = "你没有权限完成该操作";
"_error_path_"                          = "无法打开此文件或文件夹。请确认它是否存在";
"_file_upload_not_exitst_"              = "要上传的文件不存在";
"_forbidden_characters_from_server_"    = "文件名包含无效字符";
"_not_connected_internet_"              = "服务器连接错误";
"_not_possible_connect_to_server_"      = "登录失败，请检查用户名密码是否正确，或者禁用totp";
"_not_possible_create_folder_"          = "无法创建文件夹";
"_server_down_"                         = "无法连接到服务器";
"_time_out_"                            = "超时，请重试";
"_unknow_response_server_"              = "来自服务器的意外响应";
"_user_autentication_required_"         = "需要验证用户身份";
"_file_directory_locked_"               = "文件或者目录被锁定";
"_ssl_certificate_untrusted_"           = "该服务器使用了无效的证书";
"_internal_server_"                     = "内部服务器错误";
"_file_already_exists_"                 = "无法完成操作，存在重名文件";
"_file_folder_not_exists_"              = "指定路径未找到源文件";
"_folder_contents_nochanged_"           = "文件夹内容未更改";
"_images_invalid_converted_"            = "图像无效且无法生成缩略图";
"_method_not_expected_"                 = "意外的请求方法";
"_reauthenticate_user_"                 = "访问超时，请重新验证用户";
"_server_error_retry_"                  = "服务器暂时不可用";
"_too_many_files_"                      = "成功完成此项操作会涉及很多的文件";
"_too_many_request_"                    = "到达请求频率上限：已发送太多请求";
"_user_over_quota_"                     = "达到存储配额限制";
"_ssl_connection_error_"                = "SSL 连接错误，请重试";
"_bad_request_"                         = "错误的请求";
"_webdav_locked_"                       = "WebDAV已锁定：访问的资源已被锁定";
"_error_user_not_available_"            = "The user is no longer available";
"_server_response_error_"               = "Server response content error";


